Revit 2027 API
ParameterTypeId.PlanViewRange Property
 "View Range"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PlanViewRange { get; }
Public Shared ReadOnly Property PlanViewRange As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PlanViewRange {
	ForgeTypeId^ get ();
}
static member PlanViewRange : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace